Repository: starius/kodomoquiz
Catalog: */messages.po
Languages: ru

source: and write the following text:
ru: и напишите следующий текст:

source: in your <b>public_html</b>
ru: в вашей папке <b>public_html</b>

source: (today)
ru: (сегодня)

source: All quizes
ru: Все тесты

source: All quizes
ru: Все тесты

source: All quizes of
ru: Все тесты участника

source: All submissions
ru: Все решения

source: All tasks at one page
ru: Все задания на одной странице

source: Alternatively, you can use
ru: А ещё можно использовать

source: Bad csrf token
ru: Плохой csrf

source: Can't find this quiz
ru: Не могу найти тест

source: Can't find this task
ru: Не могу найти задание

source: Cancel quiz
ru: Отменить тест

source: Complete the script (write result to the file)
ru: Завершите скрипт (запишите результат в файл)

source: Dangerous zone
ru: Осторожно, не нажмите на эту кнопку по ошибке vv

source: Date
ru: Дата

source: File
ru: Файл

source: Finish this quiz
ru: Завершить этот тест

source: Finished quizes
ru: Завершенные тесты

source: Go through this test again:
ru: Пройдите этот тест ещё раз:

source: How to calculate complement DNA sequence?
ru: Как рассчитать комплементарную последовательность ДНК?

source: How to close file (variable myfile)?
ru: Как закрыть файл (переменная myfile)?

source: How to execute Python script from command line?
ru: Как выполнить скрипт Python с командной строки?

source: How to get argument 'input.fasta'?
ru: Как получить аргумент командной строки 'input.fasta'?

source: How to get command line arguments?
ru: Как получить аргументы командной строки?

source: How to get content of web page http://ya.ru as string?
ru: Как получить содержимое веб-страницы http://ya.ru как строку?

source: How to get list of all lines of file (variable aaa)?
ru: Как получить список строк файла (переменная aaa)?

source: How to get list of lines of web page http://ya.ru?
ru: Как получить список строк веб-страницы http://ya.ru?

source: How to get random number in range [1; 10]?
ru: Как получить целое случайное число в отрезке [1; 10]?

source: How to get script name ('prog.py')?
ru: Как получить имя файла со скриптом ('prog.py')?

source: How to interrupt interactive Python session?
ru: Как прервать интерактивную сессию Python?

source: How to open file aaa.txt for reading?
ru: Как открыть файл aaa.txt на чтение?

source: How to open file aaa.txt for writing?
ru: Как открыть файл aaa.txt на запись?

source: How to run external command ('dir')?
ru: Как запустить внешнюю команду ('dir')?

source: How to view Python output if it has been shadowed by FAR blue window?
ru: Как посмотреть результат работы Python, если его не видно под синим окном FAR?

source: If you choose an answer to this question at random, what is the chance you will be correct?
ru: Если вы выберете ответ к этому вопросу наугад, то какова вероятность, что вы будете правы?

source: It is not your quiz
ru: Это чужой тест

source: It is not your quiz and it is canceled
ru: Это не ваш тест и он отменён

source: Kodomo Quiz
ru: Тесты Кодомо

source: Language:
ru: Язык:

source: Let us know your transient username, otherwise all your results will be lost
ru: Сообщите нам временное гостевое имя, иначе результат пропадёт

source: Log
ru: Журнал

source: Login
ru: Войти

source: Logout
ru: Выйти

source: Main page
ru: Главная страница

source: No such quiz found
ru: Такого теста нет

source: One task at one page
ru: Одно задание на одной странице

source: Only preps can see this page
ru: Эта страница только для преподавателей

source: Other quizes by
ru: Остальные тесты участника

source: Permission denied
ru: Доступ отклонен

source: Please, create file
ru: Пожалуйста, создайте файл

source: Push to Google Docs
ru: Отправить в Google Docs

source: Quiz
ru: Тест

source: Quiz is not finished untill you press the button
ru: Тест не завершится, пока вы не нажмёте на эту кнопку

source: Quiz is not finished untill you press the button
ru: Тест не будет завершен, пока Вы не нажмёте кнопку под этим текстом

source: Result
ru: результат

source: Select
ru: Выбрать

source: Set aside this task
ru: Отложить эту задачу

source: Start new quiz:
ru: Начать новый тест:

source: Student
ru: Учащийся

source: Submission
ru: Решение

source: Submissions
ru: Решения

source: Submit programming assignment
ru: Отправить задание по программированию

source: Task
ru: Задание

source: The kodomoquiz is under the MIT license and available at
ru: Исходный код сайта kodomoquiz доступен на условиях лицензии MIT на

source: Then you can remove the file. It is checked only when you press the button above.
ru: После этот файл можно удалить. Он проверяется, когда нажимают кнопку входа.

source: This quiz is not active
ru: Этот тест не является активным

source: This quiz was canceled
ru: Этот тест отменен

source: Today quizes
ru: Тесты за сегодня

source: Update
ru: Обновить

source: Welcome to Kodomo Quiz!
ru: Добро пожаловать на Тесты Кодомо

source: What does Python print if you enter the following commands?
ru: Что напечатает Python, если ввести следующие команды?

source: What is the Python's official site?
ru: Какой официальный сайт Python?

source: Which Python code produces output 123?
ru: Какой код производит выход 123?

source: Which Python code produces this output?
ru: Какой код на Python приведёт к такому результату?

source: Your active quizes:
ru: Ваши активные тесты:

source: Your finished quizes:
ru: Ваши завершенные тесты:

source: Your submissions
ru: Ваши решения

source: Your username:
ru: Ваше имя:

source: code submissions
ru: решения задач

source: date
ru: дата

source: enable/disable quiz
ru: включить/отключить тест

source: error: invalid username
ru: ошибка, неверное имя

source: file
ru: файл

source: finished
ru: завершено

source: finished quizes
ru: завершенные тесты

source: guest login
ru: гостевой вход

source: kr
ru: кр

source: quiz
ru: тест

source: result
ru: результат

source: right answers
ru: правильные ответы

source: started
ru: начато

source: student
ru: студент

source: tasks
ru: заданий

source: today quizes
ru: тесты за сегодня

source: user
ru: пользователь
